In [79]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

from pydataset import data

import warnings
warnings.filterwarnings("ignore")

### 1. Create a pandas dataframe, `df_iris`, from the iris data.

In [2]:
df_iris = data('iris')
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [3]:
# Print the first 3 rows

df_iris.iloc[0:3]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
# print the number of rows and columns(shape)

df_iris.shape

(150, 5)

In [5]:
# print the column names

df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [6]:
# print the summary statistics for each of the numeric variables. 
# Would you recommend rescaling the data based on these statistics?
# No, no need to rescale the data, since the four variables are in the same scale. 

df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 2. Read the `Table1_CustDetails` table from the `Excel_Exercises.xlsx` file into a dataframe named `df_excel`

In [7]:
df_excel = pd.read_excel('/Users/mms3-pro/codeup-data-science/Spreadsheets_Exercises.xlsx')
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7049 non-null   object
 1   gender             7049 non-null   object
 2   is_senior_citizen  7049 non-null   int64
 3   partner            7049 non-null   object
 4   dependents         7049 non-null   object
 5   phone_service      7049 non-null   int64
 6   internet_service   7049 non-null   int64
 7   contract_type      7049 non-null   int64
 8   payment_type       7049 non-null   object
 9   monthly_charges    7049 non-null   float64
 10  total_charges      7038 non-null   float64
 11  churn              7049 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 661.0+ KB

In [8]:
# assign the first 100 rows to a new dataframe

df_excel_sample = df_excel.head(100)
df_excel_sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        100 non-null    object
 1   gender             100 non-null    object
 2   is_senior_citizen  100 non-null    int64
 3   partner            100 non-null    object
 4   dependents         100 non-null    object
 5   phone_service      100 non-null    int64
 6   internet_service   100 non-null    int64
 7   contract_type      100 non-null    int64
 8   payment_type       100 non-null    object
 9   monthly_charges    100 non-null    float64
 10  total_charges      100 non-null    float64
 11  churn              100 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 9.5+ KB

In [9]:
# print the numbers of rows of your original dataframe

df_excel.shape[0]

7049

In [10]:
# print first 5 column names

df_excel_sample.columns[0:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [11]:
# print the column names that have a data type of object

column_dtype = df_excel_sample.dtypes
column_dtype[column_dtype == 'object']

customer_id     object
gender          object
partner         object
dependents      object
payment_type    object
churn           object
dtype: object

In [12]:
# compute the range for each of the numeric varibales

a, b = df_excel.monthly_charges.agg(['min', 'max'])
print(f'The range of monthly charges is from {a} to {b}.')

c, d = df_excel.total_charges.agg(['min', 'max'])
print(f'The range of total charges is from {c} to {d}.')

The range of monthly charges is from 18.25 to 118.75.
The range of total charges is from 18.8 to 8684.8.

### 3. Read the data from `this google sheet` into a dataframe, df_google

In [13]:
G_sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = G_sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
# print first 3 rows

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
# print the number of rows and columns

df_google.shape

(891, 12)

In [16]:
# print column names

df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
# print data type of each column

df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [18]:
# print the summary statistics for each of the numeric variables

df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [19]:
# print the unique values for each of your categorical variables

df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [20]:
print(f'The unique values for Sex: {df_google.Sex.unique()}')
print(f'The unique values for Survived: {df_google.Survived.unique()}')
print(f'The unique values for Pclass: {df_google.Pclass.unique()}')
print(f'The unique values for Embarked: {df_google.Embarked.unique()}')

The unique values for Sex: ['male' 'female']
The unique values for Survived: [0 1]
The unique values for Pclass: [3 1 2]
The unique values for Embarked: ['S' 'C' 'Q' nan]

## Data Preparation Exercises

### 1-a. Use the function defined in `acqure.py` to load the iris data.

In [137]:
import os
from acquire import get_iris_data

iris = get_iris_data()
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### 1-b. Drop the `species_id` and `measurement_id` columns

In [22]:
iris.drop(columns=['species_id','measurement_id'], inplace=True)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

### 1-c. Rename the `species_name` column to just `species`

In [23]:
iris.rename(columns={'species_name':'species'}, inplace=True)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### 1-d. Create dummy variables of the species name

In [24]:
# select the columns you would like to be converted and make sure the returned is a dataframe

iris[['species']] # Why using double square bracket?

# Do the conversion by pd.get_dummies()

species_dummy = pd.get_dummies(iris[['species']])

# join the dummy vars with the original data frame

iris = pd.concat([iris, species_dummy], axis=1)
iris.sample(5)

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
36,5.5,3.5,1.3,0.2,setosa,1,0,0
23,5.1,3.3,1.7,0.5,setosa,1,0,0
86,6.7,3.1,4.7,1.5,versicolor,0,1,0
80,5.5,2.4,3.8,1.1,versicolor,0,1,0
141,6.9,3.1,5.1,2.3,virginica,0,0,1

### 1-e. Create a function named `prep_iris` that accepts the untransformed iris data, and returns the data with the transformations above applies.

In [25]:
def prep_iris(iris):
    iris.drop(columns=['species_id','measurement_id'], inplace=True)
    iris.rename(columns={'species_name':'species'}, inplace=True)
    species_dummy = pd.get_dummies(iris[['species']])
    iris = pd.concat([iris, species_dummy], axis=1)
    return iris

In [26]:
iris.head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0

In [29]:
prep_iris(iris).head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0

### 2-a. Use the function you defined in `acquire.py` to load the titanic data set.

In [138]:
from acquire import get_titanic_data

titanic = get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [139]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.5+ KB

### 2-b. Handle the missing values in the `embark_town` and `embarked` column.

In [91]:
# How many values are missing in the two columns?

titanic.embark_town.isnull().sum(), titanic.embarked.isnull().sum()

(2, 2)

In [92]:
# What are the unique values in the two columns?

titanic.embark_town.value_counts(dropna=False), titanic.embarked.value_counts(dropna=False)

(Southampton    644
 Cherbourg      168
 Queenstown      77
 NaN              2
 Name: embark_town, dtype: int64,
 S      644
 C      168
 Q       77
 NaN      2
 Name: embarked, dtype: int64)

In [93]:
# Drop the two rows.

drop_index = titanic[titanic.embarked.isnull()].index
titanic.drop(index=drop_index, inplace=True)

In [94]:
titanic.embark_town.value_counts(dropna=False), titanic.embarked.value_counts(dropna=False)

(Southampton    644
 Cherbourg      168
 Queenstown      77
 Name: embark_town, dtype: int64,
 S    644
 C    168
 Q     77
 Name: embarked, dtype: int64)

### 2-c. Remove the `deck` column

In [95]:
titanic.drop(columns='deck', inplace=True)

In [96]:
titanic.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'embark_town', 'alone'],
      dtype='object')

### 2-d. Create a dummy variable of the `embarked` column

In [97]:
embarked_dummies = pd.get_dummies(titanic[['embarked']], drop_first=True)
embarked_dummies.head()

   embarked_Q  embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [98]:
titanic = pd.concat([titanic,embarked_dummies], axis=1)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,embarked_Q,embarked_S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0,1

### 2-e. Scale the `age` and `fare` columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

In [ ]:
# Not Required.

### 2-f. Fill the missing values in `age`. The way you fill there values is up to you. Consider the tradeoffs of different methods.

In [99]:
titanic.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
embark_town       0
alone             0
embarked_Q        0
embarked_S        0
dtype: int64

In [100]:
# Split the data

train_validate, test = train_test_split(titanic, test_size=0.2, 
                                        random_state=123, 
                                        stratify=titanic.survived
                                       )

train, validate = train_test_split(train_validate, test_size=0.3, 
                                  random_state=123, 
                                  stratify=train_validate.survived
                                 )

In [101]:
train.shape, validate.shape, test.shape

((497, 14), (214, 14), (178, 14))

In [102]:
# Impute missing values in age by SimpleImputer

imputer = SimpleImputer(strategy = 'most_frequent')
imputer

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [103]:
imputer = imputer.fit(train[['age']])
imputer

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [104]:
train[['age']] = imputer.transform(train[['age']])

In [105]:
train.isnull().sum()

passenger_id    0
survived        0
pclass          0
sex             0
age             0
sibsp           0
parch           0
fare            0
embarked        0
class           0
embark_town     0
alone           0
embarked_Q      0
embarked_S      0
dtype: int64

In [106]:
validate[['age']] = imputer.transform(validate[['age']])
test[['age']] = imputer.transform(test[['age']])

In [107]:
validate.isnull().sum(), test.isnull().sum()

(passenger_id    0
 survived        0
 pclass          0
 sex             0
 age             0
 sibsp           0
 parch           0
 fare            0
 embarked        0
 class           0
 embark_town     0
 alone           0
 embarked_Q      0
 embarked_S      0
 dtype: int64,
 passenger_id    0
 survived        0
 pclass          0
 sex             0
 age             0
 sibsp           0
 parch           0
 fare            0
 embarked        0
 class           0
 embark_town     0
 alone           0
 embarked_Q      0
 embarked_S      0
 dtype: int64)

### 2-g. Create a function named `prep_titanic` that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [59]:
def cleaning(titanic):
    drop_index = titanic[titanic.embarked.isnull()].index
    titanic.drop(index=drop_index, inplace=True)
    titanic.drop(columns='deck', inplace=True)
    embarked_dummies = pd.get_dummies(titanic[['embarked']], drop_first=True)
    titanic = pd.concat([titanic,embarked_dummies], axis=1)
    return titanic

In [62]:
cleaning(titanic)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,embarked_Q,embarked_S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,Southampton,1,0,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,Southampton,1,0,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,Southampton,0,0,1
889,889,1,1,male,26.0,0,0,30.0000,C,First,Cherbourg,1,0,0
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,Queenstown,1,1,0

In [63]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  889 non-null    int64
 1   survived      889 non-null    int64
 2   pclass        889 non-null    int64
 3   sex           889 non-null    object
 4   age           712 non-null    float64
 5   sibsp         889 non-null    int64
 6   parch         889 non-null    int64
 7   fare          889 non-null    float64
 8   embarked      889 non-null    object
 9   class         889 non-null    object
 10  embark_town   889 non-null    object
 11  alone         889 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 90.3+ KB

In [64]:
titanic.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
embark_town       0
alone             0
dtype: int64

In [119]:
def cleaning_spliting(titanic):
    titanic = cleaning(titanic)
    train_validate, test = train_test_split(titanic, test_size=0.2, 
                                            random_state=123,
                                            stratify=titanic.survived
                                           )
    train, validate = train_test_split(train_validate, test_size=0.3, 
                                       random_state=123, 
                                       stratify=train_validate.survived
                                      )
    return train, validate, test

In [135]:
train, validate, test = cleaning_spliting(titanic)

In [136]:
train.isnull().sum()

passenger_id     0
survived         0
pclass           0
sex              0
age             97
sibsp            0
parch            0
fare             0
embarked         0
class            0
embark_town      0
alone            0
embarked_Q       0
embarked_S       0
dtype: int64

In [127]:
def prep_titanic(titanic):
    train, validate, test = cleaning_spliting(titanic)
    imputer = SimpleImputer(strategy = 'most_frequent')
    imputer = imputer.fit(train[['age']])
    train[['age']] = imputer.transform(train[['age']])
    validate[['age']] = imputer.transform(validate[['age']])
    test[['age']] = imputer.transform(test[['age']])
    return train, validate, test

In [140]:
train, validate, test = prep_titanic(titanic)

In [141]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,embarked_Q,embarked_S
583,583,0,1,male,36.0,0,0,40.1250,C,First,Cherbourg,1,0,0
337,337,1,1,female,41.0,0,0,134.5000,C,First,Cherbourg,1,0,0
50,50,0,3,male,7.0,4,1,39.6875,S,Third,Southampton,0,0,1
218,218,1,1,female,32.0,0,0,76.2917,C,First,Cherbourg,1,0,0
31,31,1,1,female,24.0,1,0,146.5208,C,First,Cherbourg,0,0,0

In [142]:
train.isnull().sum()

passenger_id    0
survived        0
pclass          0
sex             0
age             0
sibsp           0
parch           0
fare            0
embarked        0
class           0
embark_town     0
alone           0
embarked_Q      0
embarked_S      0
dtype: int64

- Two values are missing in the two columns. It is a very small fraction.